app/Http/Controllers/ServiceRequestController.php

    public function index(Request $request): View
    {
        // معالجة المواعيد المنتهية تلقائياً
        ServiceRequest::processScheduleExpirations();

        $user = $request->user();
        $tab = $request->query('tab', 'active');
        $search = $request->query('search');

        // استعلام الطلبات الخاصة بالمستخدم
        $query = $user->serviceRequests()
            ->with(['serviceProviderProfile.user', 'review'])
            ->latest('updated_at');

        // حساب أعداد الطلبات لكل تبويب
        $counts = [
            'all' => (clone $query)->count(),
            'active' => (clone $query)->active()->count(),
            'needs_action' => (clone $query)->needsAction()->count(),
            'completed' => (clone $query)->completed()->count(),
            'cancelled' => (clone $query)->cancelled()->count(),
        ];
---
select * from "users" where "users"."id" in (7)